Music Player Backend/app/Controllers/LaguPujian.php

SELECT `id`, `title`, `artist`, `singer`
FROM `lagu_pujian`
WHERE `title` LIKE '%tuhan%' ESCAPE '!'
OR  `artist` LIKE '%tuhan%' ESCAPE '!'
OR  `singer` LIKE '%tuhan%' ESCAPE '!'
AND  `title` LIKE 'nkb%' ESCAPE '!'
---
	public function get()
    {
		$laguPujianModel = new \App\Models\LaguPujianModel();
		$id = $this->request->getGet('id');
		$search = $this->request->getGet('search');
		$limit = $this->request->getGet('limit');
		$type = $this->request->getGet('type');
		if($id)
			$data['laguPujian'] = $laguPujianModel->find($id);
		elseif(!$type&&$search)
		{
			$data['laguPujian'] = $laguPujianModel->select('id, title, artist, singer')->like('title', $search)
												->orLike('artist', $search)->orLike('singer', $search)->orLike('category', $search)->findall();

SELECT *
FROM `lagu_pujian`
WHERE `title` LIKE 'kj%' ESCAPE '!'
---
				}
			} else {
				if($limit){
					$data['laguPujian'] = $laguPujianModel->like('title', $type, 'after')->limit($limit)->find();

SELECT *
FROM `lagu_pujian`
 LIMIT 1
---
			}
		}
		elseif(!$type&&$limit)
			$data['laguPujian'] = $laguPujianModel->limit($limit)->find();